###############################################################
#  Generated by:      Cadence Innovus 17.11-s080_1
#  OS:                Linux x86_64(Host ID cad21)
#  Generated on:      Sun Dec 14 22:16:33 2025
#  Design:            bch
#  Command:           saveDesign saved/Final_version_v3/final
###############################################################
current_design bch
create_clock [get_ports {clk}]  -name clk -period 7.000000 -waveform {0.000000 3.500000}
set_propagated_clock  [get_ports {clk}]
set_drive 1  [get_ports {clk}]
set_max_fanout 20  [get_ports {clk}]
set_drive 1  [get_ports {rstn}]
set_max_fanout 20  [get_ports {rstn}]
set_drive 1  [get_ports {mode}]
set_max_fanout 20  [get_ports {mode}]
set_drive 1  [get_ports {code[1]}]
set_max_fanout 20  [get_ports {code[1]}]
set_drive 1  [get_ports {code[0]}]
set_max_fanout 20  [get_ports {code[0]}]
set_drive 1  [get_ports {set}]
set_max_fanout 20  [get_ports {set}]
set_drive 1  [get_ports {idata[63]}]
set_max_fanout 20  [get_ports {idata[63]}]
set_drive 1  [get_ports {idata[62]}]
set_max_fanout 20  [get_ports {idata[62]}]
set_drive 1  [get_ports {idata[61]}]
set_max_fanout 20  [get_ports {idata[61]}]
set_drive 1  [get_ports {idata[60]}]
set_max_fanout 20  [get_ports {idata[60]}]
set_drive 1  [get_ports {idata[59]}]
set_max_fanout 20  [get_ports {idata[59]}]
set_drive 1  [get_ports {idata[58]}]
set_max_fanout 20  [get_ports {idata[58]}]
set_drive 1  [get_ports {idata[57]}]
set_max_fanout 20  [get_ports {idata[57]}]
set_drive 1  [get_ports {idata[56]}]
set_max_fanout 20  [get_ports {idata[56]}]
set_drive 1  [get_ports {idata[55]}]
set_max_fanout 20  [get_ports {idata[55]}]
set_drive 1  [get_ports {idata[54]}]
set_max_fanout 20  [get_ports {idata[54]}]
set_drive 1  [get_ports {idata[53]}]
set_max_fanout 20  [get_ports {idata[53]}]
set_drive 1  [get_ports {idata[52]}]
set_max_fanout 20  [get_ports {idata[52]}]
set_drive 1  [get_ports {idata[51]}]
set_max_fanout 20  [get_ports {idata[51]}]
set_drive 1  [get_ports {idata[50]}]
set_max_fanout 20  [get_ports {idata[50]}]
set_drive 1  [get_ports {idata[49]}]
set_max_fanout 20  [get_ports {idata[49]}]
set_drive 1  [get_ports {idata[48]}]
set_max_fanout 20  [get_ports {idata[48]}]
set_drive 1  [get_ports {idata[47]}]
set_max_fanout 20  [get_ports {idata[47]}]
set_drive 1  [get_ports {idata[46]}]
set_max_fanout 20  [get_ports {idata[46]}]
set_drive 1  [get_ports {idata[45]}]
set_max_fanout 20  [get_ports {idata[45]}]
set_drive 1  [get_ports {idata[44]}]
set_max_fanout 20  [get_ports {idata[44]}]
set_drive 1  [get_ports {idata[43]}]
set_max_fanout 20  [get_ports {idata[43]}]
set_drive 1  [get_ports {idata[42]}]
set_max_fanout 20  [get_ports {idata[42]}]
set_drive 1  [get_ports {idata[41]}]
set_max_fanout 20  [get_ports {idata[41]}]
set_drive 1  [get_ports {idata[40]}]
set_max_fanout 20  [get_ports {idata[40]}]
set_drive 1  [get_ports {idata[39]}]
set_max_fanout 20  [get_ports {idata[39]}]
set_drive 1  [get_ports {idata[38]}]
set_max_fanout 20  [get_ports {idata[38]}]
set_drive 1  [get_ports {idata[37]}]
set_max_fanout 20  [get_ports {idata[37]}]
set_drive 1  [get_ports {idata[36]}]
set_max_fanout 20  [get_ports {idata[36]}]
set_drive 1  [get_ports {idata[35]}]
set_max_fanout 20  [get_ports {idata[35]}]
set_drive 1  [get_ports {idata[34]}]
set_max_fanout 20  [get_ports {idata[34]}]
set_drive 1  [get_ports {idata[33]}]
set_max_fanout 20  [get_ports {idata[33]}]
set_drive 1  [get_ports {idata[32]}]
set_max_fanout 20  [get_ports {idata[32]}]
set_drive 1  [get_ports {idata[31]}]
set_max_fanout 20  [get_ports {idata[31]}]
set_drive 1  [get_ports {idata[30]}]
set_max_fanout 20  [get_ports {idata[30]}]
set_drive 1  [get_ports {idata[29]}]
set_max_fanout 20  [get_ports {idata[29]}]
set_drive 1  [get_ports {idata[28]}]
set_max_fanout 20  [get_ports {idata[28]}]
set_drive 1  [get_ports {idata[27]}]
set_max_fanout 20  [get_ports {idata[27]}]
set_drive 1  [get_ports {idata[26]}]
set_max_fanout 20  [get_ports {idata[26]}]
set_drive 1  [get_ports {idata[25]}]
set_max_fanout 20  [get_ports {idata[25]}]
set_drive 1  [get_ports {idata[24]}]
set_max_fanout 20  [get_ports {idata[24]}]
set_drive 1  [get_ports {idata[23]}]
set_max_fanout 20  [get_ports {idata[23]}]
set_drive 1  [get_ports {idata[22]}]
set_max_fanout 20  [get_ports {idata[22]}]
set_drive 1  [get_ports {idata[21]}]
set_max_fanout 20  [get_ports {idata[21]}]
set_drive 1  [get_ports {idata[20]}]
set_max_fanout 20  [get_ports {idata[20]}]
set_drive 1  [get_ports {idata[19]}]
set_max_fanout 20  [get_ports {idata[19]}]
set_drive 1  [get_ports {idata[18]}]
set_max_fanout 20  [get_ports {idata[18]}]
set_drive 1  [get_ports {idata[17]}]
set_max_fanout 20  [get_ports {idata[17]}]
set_drive 1  [get_ports {idata[16]}]
set_max_fanout 20  [get_ports {idata[16]}]
set_drive 1  [get_ports {idata[15]}]
set_max_fanout 20  [get_ports {idata[15]}]
set_drive 1  [get_ports {idata[14]}]
set_max_fanout 20  [get_ports {idata[14]}]
set_drive 1  [get_ports {idata[13]}]
set_max_fanout 20  [get_ports {idata[13]}]
set_drive 1  [get_ports {idata[12]}]
set_max_fanout 20  [get_ports {idata[12]}]
set_drive 1  [get_ports {idata[11]}]
set_max_fanout 20  [get_ports {idata[11]}]
set_drive 1  [get_ports {idata[10]}]
set_max_fanout 20  [get_ports {idata[10]}]
set_drive 1  [get_ports {idata[9]}]
set_max_fanout 20  [get_ports {idata[9]}]
set_drive 1  [get_ports {idata[8]}]
set_max_fanout 20  [get_ports {idata[8]}]
set_drive 1  [get_ports {idata[7]}]
set_max_fanout 20  [get_ports {idata[7]}]
set_drive 1  [get_ports {idata[6]}]
set_max_fanout 20  [get_ports {idata[6]}]
set_drive 1  [get_ports {idata[5]}]
set_max_fanout 20  [get_ports {idata[5]}]
set_drive 1  [get_ports {idata[4]}]
set_max_fanout 20  [get_ports {idata[4]}]
set_drive 1  [get_ports {idata[3]}]
set_max_fanout 20  [get_ports {idata[3]}]
set_drive 1  [get_ports {idata[2]}]
set_max_fanout 20  [get_ports {idata[2]}]
set_drive 1  [get_ports {idata[1]}]
set_max_fanout 20  [get_ports {idata[1]}]
set_drive 1  [get_ports {idata[0]}]
set_max_fanout 20  [get_ports {idata[0]}]
set_load -pin_load -max  0.05  [get_ports {ready}]
set_load -pin_load -min  0.05  [get_ports {ready}]
set_load -pin_load -max  0.05  [get_ports {finish}]
set_load -pin_load -min  0.05  [get_ports {finish}]
set_load -pin_load -max  0.05  [get_ports {odata[9]}]
set_load -pin_load -min  0.05  [get_ports {odata[9]}]
set_load -pin_load -max  0.05  [get_ports {odata[8]}]
set_load -pin_load -min  0.05  [get_ports {odata[8]}]
set_load -pin_load -max  0.05  [get_ports {odata[7]}]
set_load -pin_load -min  0.05  [get_ports {odata[7]}]
set_load -pin_load -max  0.05  [get_ports {odata[6]}]
set_load -pin_load -min  0.05  [get_ports {odata[6]}]
set_load -pin_load -max  0.05  [get_ports {odata[5]}]
set_load -pin_load -min  0.05  [get_ports {odata[5]}]
set_load -pin_load -max  0.05  [get_ports {odata[4]}]
set_load -pin_load -min  0.05  [get_ports {odata[4]}]
set_load -pin_load -max  0.05  [get_ports {odata[3]}]
set_load -pin_load -min  0.05  [get_ports {odata[3]}]
set_load -pin_load -max  0.05  [get_ports {odata[2]}]
set_load -pin_load -min  0.05  [get_ports {odata[2]}]
set_load -pin_load -max  0.05  [get_ports {odata[1]}]
set_load -pin_load -min  0.05  [get_ports {odata[1]}]
set_load -pin_load -max  0.05  [get_ports {odata[0]}]
set_load -pin_load -min  0.05  [get_ports {odata[0]}]
set_input_delay -add_delay 3.5 -clock [get_clocks {clk}] [get_ports {idata[7]}]
set_input_delay -add_delay 3.5 -clock [get_clocks {clk}] [get_ports {idata[19]}]
set_input_delay -add_delay 3.5 -clock [get_clocks {clk}] [get_ports {idata[26]}]
set_input_delay -add_delay 3.5 -clock [get_clocks {clk}] [get_ports {idata[40]}]
set_input_delay -add_delay 3.5 -clock [get_clocks {clk}] [get_ports {idata[33]}]
set_input_delay -add_delay 3.5 -clock [get_clocks {clk}] [get_ports {idata[3]}]
set_input_delay -add_delay 3.5 -clock [get_clocks {clk}] [get_ports {idata[15]}]
set_input_delay -add_delay 3.5 -clock [get_clocks {clk}] [get_ports {idata[22]}]
set_input_delay -add_delay 3.5 -clock [get_clocks {clk}] [get_ports {idata[63]}]
set_input_delay -add_delay 3.5 -clock [get_clocks {clk}] [get_ports {idata[56]}]
set_input_delay -add_delay 3.5 -clock [get_clocks {clk}] [get_ports {idata[49]}]
set_input_delay -add_delay 3.5 -clock [get_clocks {clk}] [get_ports {idata[11]}]
set_input_delay -add_delay 3.5 -clock [get_clocks {clk}] [get_ports {idata[52]}]
set_input_delay -add_delay 3.5 -clock [get_clocks {clk}] [get_ports {idata[45]}]
set_input_delay -add_delay 3.5 -clock [get_clocks {clk}] [get_ports {idata[38]}]
set_input_delay -add_delay 3.5 -clock [get_clocks {clk}] [get_ports {idata[8]}]
set_input_delay -add_delay 3.5 -clock [get_clocks {clk}] [get_ports {idata[27]}]
set_input_delay -add_delay 3.5 -clock [get_clocks {clk}] [get_ports {idata[41]}]
set_input_delay -add_delay 3.5 -clock [get_clocks {clk}] [get_ports {idata[34]}]
set_input_delay -add_delay 3.5 -clock [get_clocks {clk}] [get_ports {idata[4]}]
set_input_delay -add_delay 3.5 -clock [get_clocks {clk}] [get_ports {idata[16]}]
set_input_delay -add_delay 3.5 -clock [get_clocks {clk}] [get_ports {idata[23]}]
set_input_delay -add_delay 3.5 -clock [get_clocks {clk}] [get_ports {idata[30]}]
set_input_delay -add_delay 3.5 -clock [get_clocks {clk}] [get_ports {idata[57]}]
set_input_delay -add_delay 3.5 -clock [get_clocks {clk}] [get_ports {idata[0]}]
set_input_delay -add_delay 3.5 -clock [get_clocks {clk}] [get_ports {idata[12]}]
set_input_delay -add_delay 3.5 -clock [get_clocks {clk}] [get_ports {idata[60]}]
set_input_delay -add_delay 3.5 -clock [get_clocks {clk}] [get_ports {idata[53]}]
set_input_delay -add_delay 3.5 -clock [get_clocks {clk}] [get_ports {idata[46]}]
set_input_delay -add_delay 3.5 -clock [get_clocks {clk}] [get_ports {idata[39]}]
set_input_delay -add_delay 3.5 -clock [get_clocks {clk}] [get_ports {code[0]}]
set_input_delay -add_delay 3.5 -clock [get_clocks {clk}] [get_ports {idata[9]}]
set_input_delay -add_delay 3.5 -clock [get_clocks {clk}] [get_ports {idata[28]}]
set_input_delay -add_delay 3.5 -clock [get_clocks {clk}] [get_ports {idata[42]}]
set_input_delay -add_delay 3.5 -clock [get_clocks {clk}] [get_ports {idata[35]}]
set_input_delay -add_delay 3.5 -clock [get_clocks {clk}] [get_ports {rstn}]
set_input_delay -add_delay 3.5 -clock [get_clocks {clk}] [get_ports {idata[5]}]
set_input_delay -add_delay 3.5 -clock [get_clocks {clk}] [get_ports {idata[17]}]
set_input_delay -add_delay 3.5 -clock [get_clocks {clk}] [get_ports {idata[24]}]
set_input_delay -add_delay 3.5 -clock [get_clocks {clk}] [get_ports {idata[58]}]
set_input_delay -add_delay 3.5 -clock [get_clocks {clk}] [get_ports {idata[31]}]
set_input_delay -add_delay 3.5 -clock [get_clocks {clk}] [get_ports {idata[1]}]
set_input_delay -add_delay 3.5 -clock [get_clocks {clk}] [get_ports {idata[13]}]
set_input_delay -add_delay 3.5 -clock [get_clocks {clk}] [get_ports {idata[20]}]
set_input_delay -add_delay 3.5 -clock [get_clocks {clk}] [get_ports {idata[61]}]
set_input_delay -add_delay 3.5 -clock [get_clocks {clk}] [get_ports {idata[54]}]
set_input_delay -add_delay 3.5 -clock [get_clocks {clk}] [get_ports {idata[47]}]
set_input_delay -add_delay 3.5 -clock [get_clocks {clk}] [get_ports {code[1]}]
set_input_delay -add_delay 3.5 -clock [get_clocks {clk}] [get_ports {idata[29]}]
set_input_delay -add_delay 3.5 -clock [get_clocks {clk}] [get_ports {idata[50]}]
set_input_delay -add_delay 3.5 -clock [get_clocks {clk}] [get_ports {idata[43]}]
set_input_delay -add_delay 3.5 -clock [get_clocks {clk}] [get_ports {idata[36]}]
set_input_delay -add_delay 3.5 -clock [get_clocks {clk}] [get_ports {set}]
set_input_delay -add_delay 3.5 -clock [get_clocks {clk}] [get_ports {idata[6]}]
set_input_delay -add_delay 3.5 -clock [get_clocks {clk}] [get_ports {idata[18]}]
set_input_delay -add_delay 3.5 -clock [get_clocks {clk}] [get_ports {idata[25]}]
set_input_delay -add_delay 3.5 -clock [get_clocks {clk}] [get_ports {idata[32]}]
set_input_delay -add_delay 3.5 -clock [get_clocks {clk}] [get_ports {idata[59]}]
set_input_delay -add_delay 3.5 -clock [get_clocks {clk}] [get_ports {idata[2]}]
set_input_delay -add_delay 3.5 -clock [get_clocks {clk}] [get_ports {idata[14]}]
set_input_delay -add_delay 3.5 -clock [get_clocks {clk}] [get_ports {idata[21]}]
set_input_delay -add_delay 3.5 -clock [get_clocks {clk}] [get_ports {idata[62]}]
set_input_delay -add_delay 3.5 -clock [get_clocks {clk}] [get_ports {idata[55]}]
set_input_delay -add_delay 3.5 -clock [get_clocks {clk}] [get_ports {idata[48]}]
set_input_delay -add_delay 3.5 -clock [get_clocks {clk}] [get_ports {idata[10]}]
set_input_delay -add_delay 3.5 -clock [get_clocks {clk}] [get_ports {mode}]
set_input_delay -add_delay 3.5 -clock [get_clocks {clk}] [get_ports {idata[51]}]
set_input_delay -add_delay 3.5 -clock [get_clocks {clk}] [get_ports {idata[44]}]
set_input_delay -add_delay 3.5 -clock [get_clocks {clk}] [get_ports {idata[37]}]
set_output_delay -add_delay 3.5 -clock [get_clocks {clk}] [get_ports {odata[9]}]
set_output_delay -add_delay 3.5 -clock [get_clocks {clk}] [get_ports {odata[7]}]
set_output_delay -add_delay 3.5 -clock [get_clocks {clk}] [get_ports {odata[5]}]
set_output_delay -add_delay 3.5 -clock [get_clocks {clk}] [get_ports {finish}]
set_output_delay -add_delay 3.5 -clock [get_clocks {clk}] [get_ports {odata[3]}]
set_output_delay -add_delay 3.5 -clock [get_clocks {clk}] [get_ports {odata[1]}]
set_output_delay -add_delay 3.5 -clock [get_clocks {clk}] [get_ports {ready}]
set_output_delay -add_delay 3.5 -clock [get_clocks {clk}] [get_ports {odata[8]}]
set_output_delay -add_delay 3.5 -clock [get_clocks {clk}] [get_ports {odata[6]}]
set_output_delay -add_delay 3.5 -clock [get_clocks {clk}] [get_ports {odata[4]}]
set_output_delay -add_delay 3.5 -clock [get_clocks {clk}] [get_ports {odata[2]}]
set_output_delay -add_delay 3.5 -clock [get_clocks {clk}] [get_ports {odata[0]}]
