###################################################################

# Created by write_sdc on Sat Oct 18 20:46:25 2025

###################################################################
set sdc_version 1.8

set_units -time ns -resistance kOhm -capacitance pF -power mW -voltage V       \
-current mA
set_operating_conditions slow -library slow
set_wire_load_model -name tsmc13_wl10 -library slow
set_load -pin_load 0.05 [get_ports o_in_ready]
set_load -pin_load 0.05 [get_ports {o_out_data1[7]}]
set_load -pin_load 0.05 [get_ports {o_out_data1[6]}]
set_load -pin_load 0.05 [get_ports {o_out_data1[5]}]
set_load -pin_load 0.05 [get_ports {o_out_data1[4]}]
set_load -pin_load 0.05 [get_ports {o_out_data1[3]}]
set_load -pin_load 0.05 [get_ports {o_out_data1[2]}]
set_load -pin_load 0.05 [get_ports {o_out_data1[1]}]
set_load -pin_load 0.05 [get_ports {o_out_data1[0]}]
set_load -pin_load 0.05 [get_ports {o_out_data2[7]}]
set_load -pin_load 0.05 [get_ports {o_out_data2[6]}]
set_load -pin_load 0.05 [get_ports {o_out_data2[5]}]
set_load -pin_load 0.05 [get_ports {o_out_data2[4]}]
set_load -pin_load 0.05 [get_ports {o_out_data2[3]}]
set_load -pin_load 0.05 [get_ports {o_out_data2[2]}]
set_load -pin_load 0.05 [get_ports {o_out_data2[1]}]
set_load -pin_load 0.05 [get_ports {o_out_data2[0]}]
set_load -pin_load 0.05 [get_ports {o_out_data3[7]}]
set_load -pin_load 0.05 [get_ports {o_out_data3[6]}]
set_load -pin_load 0.05 [get_ports {o_out_data3[5]}]
set_load -pin_load 0.05 [get_ports {o_out_data3[4]}]
set_load -pin_load 0.05 [get_ports {o_out_data3[3]}]
set_load -pin_load 0.05 [get_ports {o_out_data3[2]}]
set_load -pin_load 0.05 [get_ports {o_out_data3[1]}]
set_load -pin_load 0.05 [get_ports {o_out_data3[0]}]
set_load -pin_load 0.05 [get_ports {o_out_data4[7]}]
set_load -pin_load 0.05 [get_ports {o_out_data4[6]}]
set_load -pin_load 0.05 [get_ports {o_out_data4[5]}]
set_load -pin_load 0.05 [get_ports {o_out_data4[4]}]
set_load -pin_load 0.05 [get_ports {o_out_data4[3]}]
set_load -pin_load 0.05 [get_ports {o_out_data4[2]}]
set_load -pin_load 0.05 [get_ports {o_out_data4[1]}]
set_load -pin_load 0.05 [get_ports {o_out_data4[0]}]
set_load -pin_load 0.05 [get_ports {o_out_addr1[11]}]
set_load -pin_load 0.05 [get_ports {o_out_addr1[10]}]
set_load -pin_load 0.05 [get_ports {o_out_addr1[9]}]
set_load -pin_load 0.05 [get_ports {o_out_addr1[8]}]
set_load -pin_load 0.05 [get_ports {o_out_addr1[7]}]
set_load -pin_load 0.05 [get_ports {o_out_addr1[6]}]
set_load -pin_load 0.05 [get_ports {o_out_addr1[5]}]
set_load -pin_load 0.05 [get_ports {o_out_addr1[4]}]
set_load -pin_load 0.05 [get_ports {o_out_addr1[3]}]
set_load -pin_load 0.05 [get_ports {o_out_addr1[2]}]
set_load -pin_load 0.05 [get_ports {o_out_addr1[1]}]
set_load -pin_load 0.05 [get_ports {o_out_addr1[0]}]
set_load -pin_load 0.05 [get_ports {o_out_addr2[11]}]
set_load -pin_load 0.05 [get_ports {o_out_addr2[10]}]
set_load -pin_load 0.05 [get_ports {o_out_addr2[9]}]
set_load -pin_load 0.05 [get_ports {o_out_addr2[8]}]
set_load -pin_load 0.05 [get_ports {o_out_addr2[7]}]
set_load -pin_load 0.05 [get_ports {o_out_addr2[6]}]
set_load -pin_load 0.05 [get_ports {o_out_addr2[5]}]
set_load -pin_load 0.05 [get_ports {o_out_addr2[4]}]
set_load -pin_load 0.05 [get_ports {o_out_addr2[3]}]
set_load -pin_load 0.05 [get_ports {o_out_addr2[2]}]
set_load -pin_load 0.05 [get_ports {o_out_addr2[1]}]
set_load -pin_load 0.05 [get_ports {o_out_addr2[0]}]
set_load -pin_load 0.05 [get_ports {o_out_addr3[11]}]
set_load -pin_load 0.05 [get_ports {o_out_addr3[10]}]
set_load -pin_load 0.05 [get_ports {o_out_addr3[9]}]
set_load -pin_load 0.05 [get_ports {o_out_addr3[8]}]
set_load -pin_load 0.05 [get_ports {o_out_addr3[7]}]
set_load -pin_load 0.05 [get_ports {o_out_addr3[6]}]
set_load -pin_load 0.05 [get_ports {o_out_addr3[5]}]
set_load -pin_load 0.05 [get_ports {o_out_addr3[4]}]
set_load -pin_load 0.05 [get_ports {o_out_addr3[3]}]
set_load -pin_load 0.05 [get_ports {o_out_addr3[2]}]
set_load -pin_load 0.05 [get_ports {o_out_addr3[1]}]
set_load -pin_load 0.05 [get_ports {o_out_addr3[0]}]
set_load -pin_load 0.05 [get_ports {o_out_addr4[11]}]
set_load -pin_load 0.05 [get_ports {o_out_addr4[10]}]
set_load -pin_load 0.05 [get_ports {o_out_addr4[9]}]
set_load -pin_load 0.05 [get_ports {o_out_addr4[8]}]
set_load -pin_load 0.05 [get_ports {o_out_addr4[7]}]
set_load -pin_load 0.05 [get_ports {o_out_addr4[6]}]
set_load -pin_load 0.05 [get_ports {o_out_addr4[5]}]
set_load -pin_load 0.05 [get_ports {o_out_addr4[4]}]
set_load -pin_load 0.05 [get_ports {o_out_addr4[3]}]
set_load -pin_load 0.05 [get_ports {o_out_addr4[2]}]
set_load -pin_load 0.05 [get_ports {o_out_addr4[1]}]
set_load -pin_load 0.05 [get_ports {o_out_addr4[0]}]
set_load -pin_load 0.05 [get_ports o_out_valid1]
set_load -pin_load 0.05 [get_ports o_out_valid2]
set_load -pin_load 0.05 [get_ports o_out_valid3]
set_load -pin_load 0.05 [get_ports o_out_valid4]
set_load -pin_load 0.05 [get_ports o_exe_finish]
set_max_fanout 20 [get_ports i_clk]
set_max_fanout 20 [get_ports i_rst_n]
set_max_fanout 20 [get_ports i_in_valid]
set_max_fanout 20 [get_ports {i_in_data[31]}]
set_max_fanout 20 [get_ports {i_in_data[30]}]
set_max_fanout 20 [get_ports {i_in_data[29]}]
set_max_fanout 20 [get_ports {i_in_data[28]}]
set_max_fanout 20 [get_ports {i_in_data[27]}]
set_max_fanout 20 [get_ports {i_in_data[26]}]
set_max_fanout 20 [get_ports {i_in_data[25]}]
set_max_fanout 20 [get_ports {i_in_data[24]}]
set_max_fanout 20 [get_ports {i_in_data[23]}]
set_max_fanout 20 [get_ports {i_in_data[22]}]
set_max_fanout 20 [get_ports {i_in_data[21]}]
set_max_fanout 20 [get_ports {i_in_data[20]}]
set_max_fanout 20 [get_ports {i_in_data[19]}]
set_max_fanout 20 [get_ports {i_in_data[18]}]
set_max_fanout 20 [get_ports {i_in_data[17]}]
set_max_fanout 20 [get_ports {i_in_data[16]}]
set_max_fanout 20 [get_ports {i_in_data[15]}]
set_max_fanout 20 [get_ports {i_in_data[14]}]
set_max_fanout 20 [get_ports {i_in_data[13]}]
set_max_fanout 20 [get_ports {i_in_data[12]}]
set_max_fanout 20 [get_ports {i_in_data[11]}]
set_max_fanout 20 [get_ports {i_in_data[10]}]
set_max_fanout 20 [get_ports {i_in_data[9]}]
set_max_fanout 20 [get_ports {i_in_data[8]}]
set_max_fanout 20 [get_ports {i_in_data[7]}]
set_max_fanout 20 [get_ports {i_in_data[6]}]
set_max_fanout 20 [get_ports {i_in_data[5]}]
set_max_fanout 20 [get_ports {i_in_data[4]}]
set_max_fanout 20 [get_ports {i_in_data[3]}]
set_max_fanout 20 [get_ports {i_in_data[2]}]
set_max_fanout 20 [get_ports {i_in_data[1]}]
set_max_fanout 20 [get_ports {i_in_data[0]}]
set_ideal_network [get_ports i_clk]
create_clock [get_ports i_clk]  -period 3.5  -waveform {0 1.75}
set_clock_latency 0.5  [get_clocks i_clk]
set_clock_uncertainty 0.1  [get_clocks i_clk]
set_input_delay -clock i_clk  1.75  [get_ports i_clk]
set_input_delay -clock i_clk  1.75  [get_ports i_rst_n]
set_input_delay -clock i_clk  1.75  [get_ports i_in_valid]
set_input_delay -clock i_clk  1.75  [get_ports {i_in_data[31]}]
set_input_delay -clock i_clk  1.75  [get_ports {i_in_data[30]}]
set_input_delay -clock i_clk  1.75  [get_ports {i_in_data[29]}]
set_input_delay -clock i_clk  1.75  [get_ports {i_in_data[28]}]
set_input_delay -clock i_clk  1.75  [get_ports {i_in_data[27]}]
set_input_delay -clock i_clk  1.75  [get_ports {i_in_data[26]}]
set_input_delay -clock i_clk  1.75  [get_ports {i_in_data[25]}]
set_input_delay -clock i_clk  1.75  [get_ports {i_in_data[24]}]
set_input_delay -clock i_clk  1.75  [get_ports {i_in_data[23]}]
set_input_delay -clock i_clk  1.75  [get_ports {i_in_data[22]}]
set_input_delay -clock i_clk  1.75  [get_ports {i_in_data[21]}]
set_input_delay -clock i_clk  1.75  [get_ports {i_in_data[20]}]
set_input_delay -clock i_clk  1.75  [get_ports {i_in_data[19]}]
set_input_delay -clock i_clk  1.75  [get_ports {i_in_data[18]}]
set_input_delay -clock i_clk  1.75  [get_ports {i_in_data[17]}]
set_input_delay -clock i_clk  1.75  [get_ports {i_in_data[16]}]
set_input_delay -clock i_clk  1.75  [get_ports {i_in_data[15]}]
set_input_delay -clock i_clk  1.75  [get_ports {i_in_data[14]}]
set_input_delay -clock i_clk  1.75  [get_ports {i_in_data[13]}]
set_input_delay -clock i_clk  1.75  [get_ports {i_in_data[12]}]
set_input_delay -clock i_clk  1.75  [get_ports {i_in_data[11]}]
set_input_delay -clock i_clk  1.75  [get_ports {i_in_data[10]}]
set_input_delay -clock i_clk  1.75  [get_ports {i_in_data[9]}]
set_input_delay -clock i_clk  1.75  [get_ports {i_in_data[8]}]
set_input_delay -clock i_clk  1.75  [get_ports {i_in_data[7]}]
set_input_delay -clock i_clk  1.75  [get_ports {i_in_data[6]}]
set_input_delay -clock i_clk  1.75  [get_ports {i_in_data[5]}]
set_input_delay -clock i_clk  1.75  [get_ports {i_in_data[4]}]
set_input_delay -clock i_clk  1.75  [get_ports {i_in_data[3]}]
set_input_delay -clock i_clk  1.75  [get_ports {i_in_data[2]}]
set_input_delay -clock i_clk  1.75  [get_ports {i_in_data[1]}]
set_input_delay -clock i_clk  1.75  [get_ports {i_in_data[0]}]
set_output_delay -clock i_clk  1.75  [get_ports o_in_ready]
set_output_delay -clock i_clk  1.75  [get_ports {o_out_data1[7]}]
set_output_delay -clock i_clk  1.75  [get_ports {o_out_data1[6]}]
set_output_delay -clock i_clk  1.75  [get_ports {o_out_data1[5]}]
set_output_delay -clock i_clk  1.75  [get_ports {o_out_data1[4]}]
set_output_delay -clock i_clk  1.75  [get_ports {o_out_data1[3]}]
set_output_delay -clock i_clk  1.75  [get_ports {o_out_data1[2]}]
set_output_delay -clock i_clk  1.75  [get_ports {o_out_data1[1]}]
set_output_delay -clock i_clk  1.75  [get_ports {o_out_data1[0]}]
set_output_delay -clock i_clk  1.75  [get_ports {o_out_data2[7]}]
set_output_delay -clock i_clk  1.75  [get_ports {o_out_data2[6]}]
set_output_delay -clock i_clk  1.75  [get_ports {o_out_data2[5]}]
set_output_delay -clock i_clk  1.75  [get_ports {o_out_data2[4]}]
set_output_delay -clock i_clk  1.75  [get_ports {o_out_data2[3]}]
set_output_delay -clock i_clk  1.75  [get_ports {o_out_data2[2]}]
set_output_delay -clock i_clk  1.75  [get_ports {o_out_data2[1]}]
set_output_delay -clock i_clk  1.75  [get_ports {o_out_data2[0]}]
set_output_delay -clock i_clk  1.75  [get_ports {o_out_data3[7]}]
set_output_delay -clock i_clk  1.75  [get_ports {o_out_data3[6]}]
set_output_delay -clock i_clk  1.75  [get_ports {o_out_data3[5]}]
set_output_delay -clock i_clk  1.75  [get_ports {o_out_data3[4]}]
set_output_delay -clock i_clk  1.75  [get_ports {o_out_data3[3]}]
set_output_delay -clock i_clk  1.75  [get_ports {o_out_data3[2]}]
set_output_delay -clock i_clk  1.75  [get_ports {o_out_data3[1]}]
set_output_delay -clock i_clk  1.75  [get_ports {o_out_data3[0]}]
set_output_delay -clock i_clk  1.75  [get_ports {o_out_data4[7]}]
set_output_delay -clock i_clk  1.75  [get_ports {o_out_data4[6]}]
set_output_delay -clock i_clk  1.75  [get_ports {o_out_data4[5]}]
set_output_delay -clock i_clk  1.75  [get_ports {o_out_data4[4]}]
set_output_delay -clock i_clk  1.75  [get_ports {o_out_data4[3]}]
set_output_delay -clock i_clk  1.75  [get_ports {o_out_data4[2]}]
set_output_delay -clock i_clk  1.75  [get_ports {o_out_data4[1]}]
set_output_delay -clock i_clk  1.75  [get_ports {o_out_data4[0]}]
set_output_delay -clock i_clk  1.75  [get_ports {o_out_addr1[11]}]
set_output_delay -clock i_clk  1.75  [get_ports {o_out_addr1[10]}]
set_output_delay -clock i_clk  1.75  [get_ports {o_out_addr1[9]}]
set_output_delay -clock i_clk  1.75  [get_ports {o_out_addr1[8]}]
set_output_delay -clock i_clk  1.75  [get_ports {o_out_addr1[7]}]
set_output_delay -clock i_clk  1.75  [get_ports {o_out_addr1[6]}]
set_output_delay -clock i_clk  1.75  [get_ports {o_out_addr1[5]}]
set_output_delay -clock i_clk  1.75  [get_ports {o_out_addr1[4]}]
set_output_delay -clock i_clk  1.75  [get_ports {o_out_addr1[3]}]
set_output_delay -clock i_clk  1.75  [get_ports {o_out_addr1[2]}]
set_output_delay -clock i_clk  1.75  [get_ports {o_out_addr1[1]}]
set_output_delay -clock i_clk  1.75  [get_ports {o_out_addr1[0]}]
set_output_delay -clock i_clk  1.75  [get_ports {o_out_addr2[11]}]
set_output_delay -clock i_clk  1.75  [get_ports {o_out_addr2[10]}]
set_output_delay -clock i_clk  1.75  [get_ports {o_out_addr2[9]}]
set_output_delay -clock i_clk  1.75  [get_ports {o_out_addr2[8]}]
set_output_delay -clock i_clk  1.75  [get_ports {o_out_addr2[7]}]
set_output_delay -clock i_clk  1.75  [get_ports {o_out_addr2[6]}]
set_output_delay -clock i_clk  1.75  [get_ports {o_out_addr2[5]}]
set_output_delay -clock i_clk  1.75  [get_ports {o_out_addr2[4]}]
set_output_delay -clock i_clk  1.75  [get_ports {o_out_addr2[3]}]
set_output_delay -clock i_clk  1.75  [get_ports {o_out_addr2[2]}]
set_output_delay -clock i_clk  1.75  [get_ports {o_out_addr2[1]}]
set_output_delay -clock i_clk  1.75  [get_ports {o_out_addr2[0]}]
set_output_delay -clock i_clk  1.75  [get_ports {o_out_addr3[11]}]
set_output_delay -clock i_clk  1.75  [get_ports {o_out_addr3[10]}]
set_output_delay -clock i_clk  1.75  [get_ports {o_out_addr3[9]}]
set_output_delay -clock i_clk  1.75  [get_ports {o_out_addr3[8]}]
set_output_delay -clock i_clk  1.75  [get_ports {o_out_addr3[7]}]
set_output_delay -clock i_clk  1.75  [get_ports {o_out_addr3[6]}]
set_output_delay -clock i_clk  1.75  [get_ports {o_out_addr3[5]}]
set_output_delay -clock i_clk  1.75  [get_ports {o_out_addr3[4]}]
set_output_delay -clock i_clk  1.75  [get_ports {o_out_addr3[3]}]
set_output_delay -clock i_clk  1.75  [get_ports {o_out_addr3[2]}]
set_output_delay -clock i_clk  1.75  [get_ports {o_out_addr3[1]}]
set_output_delay -clock i_clk  1.75  [get_ports {o_out_addr3[0]}]
set_output_delay -clock i_clk  1.75  [get_ports {o_out_addr4[11]}]
set_output_delay -clock i_clk  1.75  [get_ports {o_out_addr4[10]}]
set_output_delay -clock i_clk  1.75  [get_ports {o_out_addr4[9]}]
set_output_delay -clock i_clk  1.75  [get_ports {o_out_addr4[8]}]
set_output_delay -clock i_clk  1.75  [get_ports {o_out_addr4[7]}]
set_output_delay -clock i_clk  1.75  [get_ports {o_out_addr4[6]}]
set_output_delay -clock i_clk  1.75  [get_ports {o_out_addr4[5]}]
set_output_delay -clock i_clk  1.75  [get_ports {o_out_addr4[4]}]
set_output_delay -clock i_clk  1.75  [get_ports {o_out_addr4[3]}]
set_output_delay -clock i_clk  1.75  [get_ports {o_out_addr4[2]}]
set_output_delay -clock i_clk  1.75  [get_ports {o_out_addr4[1]}]
set_output_delay -clock i_clk  1.75  [get_ports {o_out_addr4[0]}]
set_output_delay -clock i_clk  1.75  [get_ports o_out_valid1]
set_output_delay -clock i_clk  1.75  [get_ports o_out_valid2]
set_output_delay -clock i_clk  1.75  [get_ports o_out_valid3]
set_output_delay -clock i_clk  1.75  [get_ports o_out_valid4]
set_output_delay -clock i_clk  1.75  [get_ports o_exe_finish]
